import Link from 'next/link'
import styles from '@/styles/Home.module.css'
import Image from "next/image";


export const GraphicsBody = ()=>{
    return(
        <>
            <div id="analyzeHero" className="l-row hero">
                <div className="l-block shortHeroVert">
                    <h1 className="l-twelve c-white">ТОРГОВЫЕ ГРАФИКИ</h1>
                    <p className="l-twelve l-nmb c-white">для анализа самых популярных фьючерсов, валют, акций и
                        контрактов на разницу.</p>
                </div>
            </div>

            <div className="l-row b-white">
                <div className="l-block l-npb">
                    <p className="l-eight l-push2 l-mb1">Услуги Stonks для работы с расширенными графиками,
                        тестирования стратегий на исторических данных, технического анализа и торговой симуляции
                        всегда <strong>РАБОЧИЕ</strong>.</p>
                    <div className="l-six l-mb1">
                        <h3 className="big c-blue">ВИЗУАЛИЗИРУЙТЕ</h3>
                        <p>рынки</p>
                        <p>Усовершенствованная программа Stonks для построения графиков позволяет торговать
                            фьючерсами, акциями и многим другим прямо с графика. <Link
                                data-href="https://t.me/general_stonks" href="https://t.me/general_stonks"
                                className="vidpop d-block l-mt1 c-green f-size20 f-l-height24">Приримеры нашей работы</Link>
                        </p>
                    </div>
                    <div className="l-six l-mb1 l-nmr">
                        <h3 className="big c-green">АНАЛИЗИРУЙТЕ</h3>
                        <p>поток ордеров</p>
                        <p>Используйте анализ глубины рынка, потока ордеров, бары Volumetric для определения и
                            подтверждения рыночного направления. (Доступно только наших покупателей) <Link href="/vip-stonks" target="_self"
                                                                    className="d-block l-mt1 c-green f-size20 f-l-height24">Оформить подписку</Link>
                        </p>
                    </div>
                    <div className="l-twelve t-center">
                        <picture>
                            <source type="image/webp" srcSet="/Single_Isolated_Dark-OF.png"/>
                                <source type="image/jpeg" srcSet="/Single_Isolated_Dark-OF.png"/>
                                    <Image src="/Single_Isolated_Dark-OF.png" alt="Monitor" loading="lazy" width="614"
                                         height="500"/>
                        </picture>
                    </div>
                </div>
            </div>

            <div className="l-row l-mb1" id="Ecosystem">
                <div className="l-block">
                    <div className="l-four" id="ecosystemCTA">Тысячи приложений и разработок</div>
                    <p className="l-five l-nmb c-white">Используйте дополнительные возможности от Stonks, чтобы
                        настроить автоматизированную торговлю, не тратить время на анализ графиков и сконцентрироваться на стабильном доходе.</p>
                    <Link href="/automatic" className="l-three l-nm t-center c-white eco">Автоматизированная торговля</Link>
                </div>
            </div>

            <div className="l-row b-white">
                <div id="uncover" className="l-block">
                    <h2 className="l-twelve t-left">Откройте для себя новые торговые возможности</h2>
                    <p className="l-six t-left">
                        <strong className="d-block">Мощные возможности анализа в реальном времени.</strong> Получайте уведомления с прогнозами
                        роста и падения криптовалют исходя из ваших личных критериев. Вам остается только повторять за программой и зарабатывать.
                    </p>
                    <p className="l-six l-clear t-left">
                        <strong className="d-block">Развитая система оповещений.</strong> Используйте возможности
                        настраиваемых оповещений и распространения информации в соцсетях, и делайте рыночные ордеры на
                        основе технического анализа. <Link data-href="https://t.me/general_stonks" href="https://t.me/general_stonks"
                                                        className="d-block l-mt1 vidpop t-left c-green f-size20 f-l-height24 t-left">Пример, как это происходит</Link>
                    </p>
                </div>
            </div>

            <div className="l-row b-gray">
                <div className="l-block">
                    <h2 className="l-twelve">Как торговать с графика</h2>
                    <div className="l-twelve l-mb2">
                        <p className="t-center">Сигналы по торговле позволяют размещать ордеры и вносить в них изменения прямо
                            с торгового графика. Вы сможете легко просматривать и исполнять торговые ордеры, основываясь
                            на техническом анализе, индикаторах графиков и движении цен от нашего торгового бота.</p>
                        <div style={{'width': '50%', 'margin':'0 25%'}}>
                            <div className="videoWrapper">
                                <iframe width="560" height="315" src="https://www.youtube.com/embed/nK7b6QQHyjU"
                                        title="YouTube video player" frameBorder="0"
                                        allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
                                        allowFullScreen></iframe>
                            </div>
                        </div>
                    </div>
                    <div className="l-twelve l-nm">
                        <div className="l-six">
                            <h3 className="f-bold f-size24 t-left">Мгновенно реагируйте на результаты технического
                                анализа</h3>
                            <ul className="l-gTri l-twelve">
                                <li>Используйте указанные нами Take Profit и Stop loss чтобы
                                    размещать ордера, не отводя взгляда от торгового графика
                                </li>
                                <li>Настраивайте 100 индикаторов и используйте более 10 стилей графиков для оптимального
                                    технического анализа, включая свечной график, Фибоначчи, MACD, RSI и многое другое.
                                </li>
                            </ul>
                        </div>
                        <div className="l-six l-nmr">
                            <h3 className="f-bold f-size24 t-left">Отслеживайте движение рынка и управляйте
                                ордерами</h3>
                            <ul className="l-gTri l-twelve">
                                <li>Следите за рынком при входе и выходе из позиций, проверяйте прибыль и убытки, а
                                    также изменяйте ордеры, исходя из технического анализа
                                </li>
                                <li>Облегчите управление ордерами с помощью визуализации ваших позиций, ордеров,
                                    исполнения и данных о прибыли и убытках на торговом графике.
                                </li>
                            </ul>
                        </div>
                    </div>
                </div>
            </div>

            <div className="l-row b-white">
                <div className="l-block gsf">
                    <h2 className="l-twelve">Начните совершенно БЕСПЛАТНО</h2>
                    <div className="l-four t-center icon default">
                        <svg xmlns="http://www.w3.org/2000/svg" width="58" height="90" viewBox="0 0 58 90">
                            <g fill="#00AEEF">
                                <path
                                    d="M43.589 37.4l4.844-8.717v-28.683h-40.167v28.684l5.837 8.906c-8.056 4.994-13.425 13.912-13.425 24.088 0 15.64 12.68 28.322 28.322 28.322 15.643 0 28.322-12.682 28.322-28.322 0-10.307-5.505-19.323-13.733-24.278zm-5.797-29.535v25.945c-2.417-.789-4.975-1.264-7.628-1.369v-24.576h7.628zm-18.887 0h7.628v24.66c-2.666.23-5.225.828-7.628 1.746v-26.406zm10.095 77.776c-13.214 0-23.964-10.748-23.964-23.963s10.75-23.963 23.964-23.963 23.964 10.748 23.964 23.963-10.75 23.963-23.964 23.963zM33.371 55.66l-4.371-13.453-4.372 13.453h-14.145l11.444 8.315-4.371 13.453 11.444-8.315 11.444 8.315-4.371-13.453 11.444-8.315z"></path>
                            </g>
                        </svg>
                        <p className="t-base l-mb1">
                            <strong className="d-block l-mb1">Признанная технология</strong> Признанное лидерство <span
                            className="d-block">в индустрии</span>
                        </p>
                    </div>
                    <div className="l-four t-center icon default">
                        <svg xmlns="http://www.w3.org/2000/svg" width="135.359" height="90" viewBox="0 0 135.359 90">
                            <path fill="#00AEEF"
                                  d="M15.53 12.362l-9.224-4.289c-1.669-.771-3.65-.049-4.435 1.619-.771 1.677-.048 3.658 1.623 4.441l9.224 4.291 11.322 31.006 22.5-48.391-31.01 11.323zm7.33 13.084c-1.617-.754-2.686-2.209-3.016-3.82 1.529.403 3.187-.26 3.888-1.77.69-1.494.149-3.179-1.165-4.086 1.452-.797 3.251-.92 4.865-.176 2.728 1.258 3.909 4.498 2.636 7.219-1.258 2.725-4.49 3.895-7.208 2.633zm110.534 17.919c-.604-1.653-1.812-2.966-3.412-3.704l-80.344-37.353-22.636 48.682c8.556 3.972 80.35 37.348 80.354 37.357 3.274 1.529 7.212.094 8.737-3.19l17.079-36.761c.753-1.585.826-3.375.222-5.031z"></path>
                            <g fill="#fff">
                                <path
                                    d="M45.141 33.923c-1.367 2.893.356 5.083 2.917 6.296 1.674.791 4.462 1.515 5.513-.708 1.109-2.347-1.962-4.288-4.759-6.653-2.827-2.38-5.495-5.168-3.565-9.252 2.105-4.449 7.32-4.594 11.25-2.736 4.539 2.146 7.778 6.098 5.398 11.129l-4.63-2.19c1.087-2.692-.456-4.246-2.742-5.324-1.523-.722-3.593-.914-4.457.917-.793 1.674.145 2.377 4.935 6.359 1.395 1.144 5.799 4.454 3.466 9.392-1.888 3.99-6.441 5.494-12.353 2.701-4.814-2.278-8.202-6.788-5.605-12.12l4.632 2.189zM74.482 30.01l4.908 2.319-2.155 25.604-4.962-2.351.643-5.619-8.135-3.849-3.996 4.038-4.847-2.294 18.544-17.848zm-6.765 13.127l5.637 2.666 1.032-9.28-.06-.031-6.609 6.645zM87.857 62.951l-5.396-2.55 3.217-25.101 4.938 2.333-2.391 17.587.065.031 12.138-12.98 4.937 2.335-17.508 18.345zM107.232 45.491l16.271 7.692-1.902 4.024-11.485-5.435-2.206 4.666 10.543 4.983-1.756 3.716-10.545-4.983-2.519 5.333 11.729 5.546-1.899 4.023-16.517-7.811 10.286-21.754z"></path>
                            </g>
                        </svg>
                        <p className="t-base l-mb2">
                            <strong className="d-block l-mb1">Несомненная экономия для трейдеров</strong> Значительные
                            скидки на комиссии и <span className="d-block">низкая маржа на фьючерсы</span>
                        </p>
                    </div>
                    <div className="l-four t-center l-nm icon default">
                        <svg xmlns="http://www.w3.org/2000/svg" width="196.947" height="90" viewBox="0 0 196.947 90">
                            <g fill="#00AEEF">
                                <path
                                    d="M39.422.646h11.402v28.166h-6.043v-22.808h-5.359v-5.358zM68.312 29.134c-3.895 0-6.809-1.323-8.742-3.97-1.936-2.646-2.902-6.178-2.902-10.597s.967-7.952 2.902-10.599c1.934-2.645 4.848-3.968 8.742-3.968 3.896 0 6.811 1.323 8.744 3.969 1.936 2.646 2.902 6.18 2.902 10.599s-.967 7.951-2.902 10.597c-1.933 2.646-4.847 3.969-8.744 3.969zm-4.15-21.358c-.887 1.72-1.33 3.989-1.33 6.811s.443 5.092 1.33 6.811 2.271 2.578 4.15 2.578c1.881 0 3.266-.859 4.152-2.578.885-1.719 1.328-3.989 1.328-6.811s-.443-5.091-1.328-6.811c-.887-1.719-2.271-2.578-4.152-2.578-1.878 0-3.263.86-4.15 2.578zM96.117 29.134c-3.896 0-6.811-1.323-8.744-3.97-1.934-2.646-2.9-6.178-2.9-10.597s.967-7.952 2.9-10.599c1.934-2.645 4.848-3.968 8.744-3.968 3.895 0 6.809 1.323 8.744 3.969 1.934 2.646 2.9 6.18 2.9 10.599s-.967 7.951-2.9 10.597c-1.935 2.646-4.849 3.969-8.744 3.969zm-4.15-21.358c-.887 1.72-1.33 3.989-1.33 6.811s.443 5.092 1.33 6.811 2.27 2.578 4.15 2.578c1.879 0 3.264-.859 4.15-2.578s1.328-3.989 1.328-6.811-.441-5.091-1.328-6.811c-.887-1.719-2.271-2.578-4.15-2.578-1.881 0-3.263.86-4.15 2.578zM123.92 29.134c-3.895 0-6.809-1.323-8.744-3.97-1.934-2.646-2.9-6.178-2.9-10.597s.967-7.952 2.9-10.599c1.935-2.645 4.849-3.968 8.744-3.968 3.896 0 6.811 1.323 8.744 3.969 1.934 2.646 2.902 6.18 2.902 10.599s-.969 7.951-2.902 10.597c-1.934 2.646-4.848 3.969-8.744 3.969zm-4.15-21.358c-.887 1.72-1.33 3.989-1.33 6.811s.443 5.092 1.33 6.811 2.27 2.578 4.15 2.578 3.264-.859 4.15-2.578 1.33-3.989 1.33-6.811-.443-5.091-1.33-6.811c-.887-1.719-2.27-2.578-4.15-2.578s-3.264.86-4.15 2.578zM157.002 22.062c0 2.136-.785 3.849-2.357 5.138-1.572 1.29-3.566 1.935-5.984 1.935-1.611 0-3.289-.289-5.037-.866-1.746-.578-3.316-1.431-4.713-2.559l2.658-3.788c2.258 1.746 4.66 2.619 7.213 2.619.779 0 1.396-.154 1.854-.464.457-.308.686-.718.686-1.229s-.316-.98-.947-1.41-1.545-.832-2.74-1.209c-1.195-.376-2.109-.698-2.738-.968-.633-.268-1.352-.657-2.156-1.168-1.641-1.021-2.459-2.531-2.459-4.533 0-2.001.807-3.633 2.418-4.896 1.611-1.262 3.693-1.894 6.246-1.894 2.551 0 5.104.86 7.656 2.579l-2.258 4.029c-1.881-1.289-3.754-1.934-5.621-1.934s-2.799.51-2.799 1.531c0 .564.295 1.007.885 1.329.592.323 1.572.699 2.943 1.129 1.369.43 2.342.759 2.92.987s1.27.584 2.076 1.067c1.502.914 2.254 2.44 2.254 4.575z"></path>
                                <path opacity=".5"
                                      d="M54.879 51.79c-1.553 1.544-3.496 2.316-5.828 2.316-2.33 0-4.273-.772-5.828-2.316-1.553-1.545-2.33-3.434-2.33-5.668s.777-4.124 2.33-5.668c1.555-1.545 3.498-2.317 5.828-2.317 2.332 0 4.275.772 5.828 2.317 1.555 1.544 2.332 3.434 2.332 5.668s-.777 4.123-2.332 5.668zm-9.338-2.012c.922.943 2.092 1.414 3.51 1.414s2.59-.471 3.514-1.414c.922-.941 1.383-2.161 1.383-3.656 0-1.496-.461-2.715-1.383-3.657-.924-.942-2.096-1.414-3.514-1.414s-2.588.472-3.51 1.414c-.924.942-1.385 2.161-1.385 3.657 0 1.495.461 2.715 1.385 3.656zM64.701 37.088v1.282h4.078v2.622h-4.078v12.881h-3.264v-12.881h-1.953v-2.622h1.953v-1.194c0-1.633.49-2.929 1.471-3.891s2.166-1.442 3.555-1.442 2.656.515 3.803 1.545l-1.34 2.302c-.641-.681-1.311-1.021-2.012-1.021-.699 0-1.242.219-1.631.655-.388.438-.582 1.026-.582 1.764z"></path>
                                <path
                                    d="M74.113 49.239l-2.041 4.634h-3.672l8.975-20.369h3.674l8.975 20.369h-3.672l-2.041-4.634h-10.198zm8.801-3.176l-3.701-8.393-3.701 8.393h7.402zM106.605 35.281c1.416 1.186 2.127 3.012 2.127 5.479 0 2.468-.725 4.274-2.172 5.42-1.447 1.147-3.666 1.72-6.658 1.72h-3.613v5.974h-3.439v-20.37h6.994c3.088 0 5.342.593 6.761 1.777zm-2.433 8.407c.689-.729 1.033-1.797 1.033-3.205 0-1.409-.438-2.405-1.311-2.987-.875-.583-2.244-.874-4.109-.874h-3.496v8.158h3.992c1.905 0 3.199-.363 3.891-1.092zM126.537 35.281c1.416 1.186 2.127 3.012 2.127 5.479 0 2.468-.725 4.274-2.172 5.42-1.447 1.147-3.666 1.72-6.658 1.72h-3.613v5.974h-3.439v-20.37h6.994c3.087 0 5.341.593 6.761 1.777zm-2.433 8.407c.689-.729 1.033-1.797 1.033-3.205 0-1.409-.436-2.405-1.311-2.987-.875-.583-2.244-.874-4.109-.874h-3.496v8.158h3.992c1.904 0 3.199-.363 3.891-1.092zM138.877 36.185c-1.002 0-1.82.204-2.463.612-.641.407-.961 1.024-.961 1.851 0 .825.32 1.457.961 1.895.643.437 2.006.907 4.096 1.412 2.088.506 3.66 1.215 4.721 2.127 1.059.914 1.588 2.259 1.588 4.037 0 1.777-.672 3.22-2.012 4.327s-3.098 1.661-5.273 1.661c-3.188 0-6.014-1.098-8.48-3.293l2.156-2.594c2.059 1.787 4.195 2.681 6.41 2.681 1.107 0 1.988-.237 2.639-.714.65-.476.975-1.107.975-1.894 0-.787-.305-1.399-.916-1.836-.613-.438-1.666-.835-3.162-1.194-1.496-.36-2.633-.689-3.41-.991s-1.467-.694-2.068-1.181c-1.205-.913-1.807-2.312-1.807-4.195 0-1.885.686-3.338 2.055-4.357 1.369-1.021 3.064-1.529 5.084-1.529 1.301 0 2.594.213 3.877.641 1.281.428 2.389 1.03 3.32 1.807l-1.834 2.594c-.604-.544-1.42-.991-2.449-1.341s-2.047-.526-3.047-.526z"></path>
                                <path opacity=".5"
                                      d="M18.541 79.106c-1.904 0-3.525-.529-4.865-1.588-1.342-1.059-2.012-2.511-2.012-4.356 0-2.195 1.594-4.147 4.779-5.858-.797-.912-1.355-1.66-1.676-2.243s-.48-1.32-.48-2.214c0-1.555.572-2.749 1.719-3.585 1.146-.835 2.496-1.253 4.051-1.253s2.875.398 3.963 1.195 1.633 1.913 1.633 3.351c0 1.923-1.555 3.739-4.662 5.449 1.553 1.904 2.816 3.361 3.787 4.371.602-.894 1.068-1.933 1.398-3.118l2.391 1.69c-.506 1.341-1.078 2.517-1.719 3.526.775.797 1.768 1.759 2.971 2.885l-2.186 2.039-2.68-2.651c-1.711 1.573-3.848 2.36-6.412 2.36zm-2.535-3.657c.738.554 1.719.831 2.943.831s2.525-.563 3.904-1.69c-1.961-2.059-3.516-3.788-4.662-5.188-2.195 1.186-3.293 2.487-3.293 3.905 0 .875.37 1.589 1.108 2.142zm4.037-14.846c-.652 0-1.234.204-1.75.611-.514.408-.771.885-.771 1.428 0 .545.131 1.035.395 1.473.262.437.713 1.044 1.354 1.82 2.195-1.088 3.293-2.098 3.293-3.029 0-.777-.258-1.355-.771-1.734-.518-.38-1.1-.569-1.75-.569z"></path>
                                <path
                                    d="M36.346 74.24l-2.039 4.634h-3.672l8.975-20.369h3.672l8.975 20.369h-3.67l-2.041-4.634h-10.2zm8.8-3.177l-3.701-8.393-3.701 8.393h7.402zM70.498 61.171c1.963 1.777 2.943 4.25 2.943 7.416 0 3.167-.951 5.673-2.855 7.518-1.904 1.847-4.818 2.77-8.742 2.77h-6.76v-20.37h6.994c3.651 0 6.459.888 8.42 2.666zm-.523 7.504c0-4.663-2.672-6.994-8.014-6.994h-3.439v13.958h3.818c2.467 0 4.355-.587 5.668-1.763 1.31-1.175 1.967-2.909 1.967-5.201zM93.287 61.171c1.961 1.777 2.943 4.25 2.943 7.416 0 3.167-.953 5.673-2.855 7.518-1.904 1.847-4.818 2.77-8.742 2.77h-6.762v-20.37h6.994c3.653 0 6.459.888 8.422 2.666zm-.525 7.504c0-4.663-2.672-6.994-8.014-6.994h-3.439v13.958h3.818c2.467 0 4.357-.587 5.668-1.763 1.312-1.175 1.967-2.909 1.967-5.201zM99.932 71.704v-3.059h9.674v3.059h-9.674zM131.578 76.062c-2.061 2.011-4.605 3.016-7.635 3.016-3.031 0-5.576-1.005-7.637-3.016-2.059-2.011-3.088-4.518-3.088-7.519s1.029-5.508 3.088-7.519c2.061-2.011 4.605-3.016 7.637-3.016 3.029 0 5.574 1.005 7.635 3.016 2.059 2.011 3.088 4.518 3.088 7.519s-1.029 5.508-3.088 7.519zm-2.521-12.75c-1.389-1.438-3.094-2.157-5.113-2.157-2.021 0-3.727.719-5.115 2.157-1.389 1.438-2.082 3.181-2.082 5.23s.693 3.794 2.082 5.231 3.094 2.156 5.115 2.156c2.02 0 3.725-.719 5.113-2.156s2.084-3.182 2.084-5.231-.696-3.792-2.084-5.23zM154.277 58.505h3.439v20.369h-3.73l-11.539-14.862v14.862h-3.439v-20.369h3.439l11.83 15.211v-15.211zM169.533 61.186c-1.002 0-1.822.203-2.463.612-.641.407-.961 1.023-.961 1.85s.32 1.457.961 1.895 2.006.908 4.094 1.413c2.09.505 3.662 1.214 4.721 2.127 1.061.913 1.59 2.259 1.59 4.036s-.672 3.22-2.012 4.327-3.098 1.661-5.273 1.661c-3.188 0-6.014-1.098-8.48-3.293l2.156-2.594c2.059 1.788 4.195 2.682 6.41 2.682 1.107 0 1.986-.238 2.639-.714.65-.476.975-1.108.975-1.894 0-.787-.305-1.399-.918-1.837-.611-.437-1.666-.835-3.16-1.194-1.498-.359-2.633-.689-3.41-.991-.777-.301-1.467-.694-2.068-1.181-1.205-.912-1.807-2.312-1.807-4.195 0-1.885.684-3.337 2.055-4.356 1.369-1.021 3.064-1.53 5.084-1.53 1.301 0 2.594.214 3.875.641 1.283.428 2.391 1.03 3.322 1.807l-1.836 2.594c-.602-.543-1.418-.99-2.447-1.34s-2.047-.526-3.047-.526zM160.01 16.882v4.318h32.619v64.483h-188.311v-64.483h32.453v-4.318h-36.771v73.118h196.947v-73.118z"></path>
                            </g>
                        </svg>
                        <p className="t-base l-mb2">
                            <strong className="d-block l-mb1">Персонализируйте платформу</strong> Персонализируйте
                            платформу через использование индикаторов <span
                            className="d-block">сигналов, и стратегий</span>
                        </p>
                    </div>
                    <div className="l-twelve t-center">
                        <Link href="https://t.me/general_stonks" className="redFlat translate f-size32 f-l-height32">НАЧНИТЕ РАБОТУ</Link>
                    </div>
                </div>
            </div>
        </>
    )
}